nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmke15z/demo_apps/bubble/pin_mux.h
/*
 * Copyright 2019 ,2021 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*! @name PORTC6 (number 81), UART1_RX_TGTMCU
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_DEBUG_UART_RX_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_DEBUG_UART_RX_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_DEBUG_UART_RX_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORTC7 (number 80), UART1_TX_TGTMCU
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_DEBUG_UART_TX_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_DEBUG_UART_TX_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_DEBUG_UART_TX_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORTD0 (number 4), D4[1]/RGB_RED
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LED_RED_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_LED_RED_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_LED_RED_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTD15 (number 22), D4[3]/RGB_BLUE
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LED_BLUE_PORT PORTD                /*!<@brief PORT peripheral base pointer */
#define BOARD_LED_BLUE_PIN 15U                   /*!<@brief PORT pin number */
#define BOARD_LED_BLUE_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                                 /* @} */

/*! @name PORTB9 (number 76), U1[3]/FXOS_RST
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_ACCEL_RST_FGPIO FGPIOB             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_ACCEL_RST_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define BOARD_ACCEL_RST_GPIO_PIN_MASK (1U << 9U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_ACCEL_RST_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_ACCEL_RST_PIN 9U                   /*!<@brief PORT pin number */
#define BOARD_ACCEL_RST_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                                 /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/*! @name PORTA3 (number 72), J4[12]/Arduino_A5_ADC1_SE1/FXOS_SCL
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_I2C_CONFIGUREPINS_ACCEL_I2C_SCL_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define BOARD_I2C_CONFIGUREPINS_ACCEL_I2C_SCL_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_I2C_CONFIGUREPINS_ACCEL_I2C_SCL_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                                       /* @} */

/*! @name PORTA2 (number 73), J4[10]/Arduino_A4_ADC1_SE0/FXOS_SDA
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_I2C_CONFIGUREPINS_ACCEL_I2C_SDA_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define BOARD_I2C_CONFIGUREPINS_ACCEL_I2C_SDA_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_I2C_CONFIGUREPINS_ACCEL_I2C_SDA_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                                       /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_I2C_ConfigurePins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
